<?php
	/*
		流程控制
			分支结构
			循环结构:就是重复的干一件事
				几个要素:1.起点2.影响条件3.终止条件
				while循环
					语法格式:
						起点的变量(起始条件):只执行一次
						while(终止条件){
							循环体
							影响条件(++ --)
						}
						do while循环
						for循环
	*/
	//循环输出1-100;
	//$i=1;
	//while($i<=100){
	//	echo $i."<br/>";
	//	$i++;
	//}
	
	//while(条件表达式) 条件表达式也是布尔类型的值,如果表达式满足,就是true,就进入循环体
		//不满足就跳出循环
		
	//$i=1;
	//$sum+=$i;
	//$i++;
	
	
	$i=1;
	while($i<=100){
		if($i%2==0){
			
		}
		$i++;
	}
	$i=0;
	while($i<=100){
		$i+=2;
	}
	
	$i=1;
	$sum=0;
	while($i<=5){
		if($i%2==0){
			$sum+=$i;
		}
		$i++;
	}
	
	echo $sum;
	
	
	
	
	
	
	
	