<?php
	/*
		100元买100只鸡
			小鸡	1元3只
			母鸡	3元1只
			公鸡	5元1只
			所有的鸡加在一起等于100,并且,没一种鸡至少有一只
				小计的价格+母鸡的价格+公鸡的价格=100
			得到小鸡的价钱:
			xj=1/3;
			得到母鸡的价钱
			mj=3
			得到公鸡的价钱
			gj=5
			
	
	*/
	//小鸡的单价
	$xjdj=1/3;
	//母鸡的单价
	$mjdj=3;
	//公鸡的单价
	$gjdj=5;
	//循环小鸡
	for($xj=1;$xj<=100;$xj++){
		//循环母鸡
		for($mj=1;$mj<=100;$mj++){
			//循环公鸡
			for($gj=1;$gj<=20;$gj++){
				//小鸡的个数+母鸡的个数+公鸡的个数=100
				//小鸡的价钱+母鸡的价钱+公鸡的价钱=100
				//echo $xj*$xjdj.'<br/>';
				if(($xj+$mj+$gj==100)&&($xj*$xjdj+$mj*$mjdj+$gj*$gjdj==100)){
					echo '小鸡'.$xj.'<br/>';
					echo '公鸡'.$gj.'<br/>';
					echo '母鸡'.$mj.'<br/>';
					
				}
			}
		}
	}